magdyadel/embedded_System_Online_Diploma/MCU_Interfacing/Unit8_lesson3/Drivers_STM32F103C6-USART/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

#include "stm32f103x6.h"
#include "Stm32_F103C6_gpio_driver.h"
#include "Stm32_F103C6_EXTI_driver.h"
#include "Stm32_F103C6_USART_driver.h"

void clock_init()
{
	//Enable Clock
	RCC_GPIOA_CLK_EN ();
	RCC_GPIOB_CLK_EN ();
	//Enable AFIO
	RCC_AFIO_CLK_EN ();
}



unsigned char ch ;

void UART_IRQ_Callback(void)
{
	MCAL_USART_ReceiveData(USART1, &ch, disable);
	MCAL_USART_SendData(USART1, &ch, enable);
}

int main(void)
{
	USART_Config_t uartCFG;

	clock_init();
	uartCFG.BaudRate = USART_BaudRate_115200 ;
	uartCFG.HWFlowCtl = USART_HWFlowCtl_NONE ;
	uartCFG.IRQ_Enable = USART_IRQ_Enable_RXNEIE ;
	uartCFG.P_IRQ_CallBack = UART_IRQ_Callback ;
	uartCFG.Parity = USART_Parity_NONE ;
	uartCFG.Payload_Length = USART_Payload_Length_8B ;
	uartCFG.StopBits = USART_StopBits__1 ;
	uartCFG.USART_MODE = USART_MODE_TX_RX ;

	MCAL_USART_Init(USART1, &uartCFG);
	MCAL_USART_GPIO_Set_Pins(USART1);

	ch ="K";
	while(1)
    {


    }

	return 0;
}
